Revit 2027 API
Group.GetAvailableAttachedDetailGroupTypeIds Method
 Returns the attached detail groups available for this group type.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ISet<ElementId> GetAvailableAttachedDetailGroupTypeIds()
Public Function GetAvailableAttachedDetailGroupTypeIds As ISet(Of ElementId)
public:
ISet<ElementId^>^ GetAvailableAttachedDetailGroupTypeIds()
member GetAvailableAttachedDetailGroupTypeIds : unit -> ISet<ElementId>
Return Value
ISet<ElementId>
 Returns the collection of attached detail group Ids that match this group's type.
Exceptions
Exception | Condition
InvalidOperationException |  The input group is not a model group and can therefore not have attached detail groups.
See Also
Reference
Group Class
Autodesk.Revit.DB Namespace